---
# Experto Big Data UNAV 2018 - Notebook 10 - Pandas I

---

# Series en Pandas

## Creacion de objetos Series

In [2]:
import pandas as pd # import pandas
import numpy as np # import numpy
import matplotlib.pyplot as plt # import libreria para plotear
pd.set_option('max_columns', 50) # maximo de columnas a mostrar cuando se muestra un pandas dataframe
# indica a python que plotee en el notebook
%matplotlib inline

La _Series_ es un array unidimensional etiquetado capaz de contener cualquier tipo de datos (enteros, cadenas, números de coma flotante, objetos de Python, etc.). Las etiquetas de los ejes se denominan colectivamente como índices. En el fondo es como un array _NumPy_ pero su manejo es mucho mas intuitivo y sencillo.

Crear una estructura _Series_ desde una lista con indice por defecto que van desde _0_ hasta _n-1_ elementos.

In [26]:
# crear una estructura Series desde una lista arbitraria
s = pd.Series([7, 'Heisenberg', 3.14, -1789710578, 'Happy Eating!'])
print(s)
print(s.shape)

0                7
1       Heisenberg
2             3.14
3      -1789710578
4    Happy Eating!
dtype: object
(5,)

In [4]:
print(s[0])
print(s[1])
print(s[2])
print(s[3])
print(s[4])

7
Heisenberg
3.14
-1789710578
Happy Eating!

Crear una estructura _Series_ con indicando un indice.

In [5]:
s = pd.Series([7, 'Heisenberg', 3.14, -1789710578, 'Happy Eating!'],
              index=['A', 'Z', 'C', 'Y', 'E'])
print(s)
print(s['A'])

A                7
Z       Heisenberg
C             3.14
Y      -1789710578
E    Happy Eating!
dtype: object
7

## Parametros y argumentos

A una estructura _Series_ al definirla se le pueden pasar los parametros _data_ con un array like,  y _index_ con los indices.

In [8]:
frutas = ["Manzana", "Naranja", "Ciruela", "Uva", "Fresa"]
dias = ["Lunes", "Martes", "Miercoles", "Jueves", "Viernes"]

print(pd.Series(frutas, dias))
print(10 * '-')
print(pd.Series(data = frutas, index = dias))
print(10 * '-')
print(pd.Series(frutas, index = dias))

Lunes        Manzana
Martes       Naranja
Miercoles    Ciruela
Jueves           Uva
Viernes        Fresa
dtype: object
----------
Lunes        Manzana
Martes       Naranja
Miercoles    Ciruela
Jueves           Uva
Viernes        Fresa
dtype: object
----------
Lunes        Manzana
Martes       Naranja
Miercoles    Ciruela
Jueves           Uva
Viernes        Fresa
dtype: object

Se puede acceder a los elementos utilizando el indice.

In [9]:
print(s['A'])
print(s['Z'])
print(s['C'])
print(s['Y'])
print(s['E'])

7
Heisenberg
3.14
-1789710578
Happy Eating!

Se puede acceder a los elementos igualmente utilizando el indice numerico.

In [10]:
print(s[0])
print(s[1])
print(s[2])
print(s[3])
print(s[4])

7
Heisenberg
3.14
-1789710578
Happy Eating!

Tambien se puede convertir un diccionario a una estructura _Series_.

In [11]:
d = {'Chicago': 1000, 'New York': 1300, 'Portland': 900, 'San Francisco': 1100,
     'Austin': 450, 'Boston': None}
cities = pd.Series(d)
print(cities)

Austin            450.0
Boston              NaN
Chicago          1000.0
New York         1300.0
Portland          900.0
San Francisco    1100.0
dtype: float64

Se puede usar el indice para acceder a la estructura.

In [16]:
print(cities['Chicago'])

1000.0

In [17]:
print(cities[['Chicago', 'Portland', 'San Francisco']])

Chicago          1000.0
Portland          900.0
San Francisco    1100.0
dtype: float64

O se puede utilizar indexado booleano (como en numpy) para el acceso.

In [15]:
print(cities[cities < 1000])

Austin      450.0
Portland    900.0
dtype: float64

Que ocurrio arriba? cities < 1000 devuelve un _Series_ de valores _True/False_ que depues se pasan a la estructura _Series_ idexando los items que corresponden con los valore _True_.

In [18]:
less_than_1000 = cities < 1000
print(less_than_1000)
print('\n')
print(cities[less_than_1000])

Austin            True
Boston           False
Chicago          False
New York         False
Portland          True
San Francisco    False
dtype: bool


Austin      450.0
Portland    900.0
dtype: float64

Se puede cambiar el valor de _Series_.

In [ ]:
# cambiando valores basado en el indice
print('Old value:', cities['Chicago'])
cities['Chicago'] = 1400
print('New value:', cities['Chicago'])

In [ ]:
# cambiando valores usando logica booleana
print(cities[cities < 1000])
print('\n')
cities[cities < 1000] = 750

print cities[cities < 1000]

Se puede comprobar si un item esta contenido en la _Series_.

In [ ]:
print('Seattle' in cities)
print('San Francisco' in cities)

Se pueden hacer operaciones aritmeticas.

In [19]:
# dividir por 3
print( cities / 3 )

Austin           150.000000
Boston                  NaN
Chicago          333.333333
New York         433.333333
Portland         300.000000
San Francisco    366.666667
dtype: float64

In [ ]:
# elevar al cuadrado
print np.square(cities)

In [20]:
print(cities[['Chicago', 'New York', 'Portland']])
print('\n')
print(cities[['Austin', 'New York']])
print('\n')
print(cities[['Chicago', 'New York', 'Portland']] + cities[['Austin', 'New York']])

Chicago     1000.0
New York    1300.0
Portland     900.0
dtype: float64


Austin       450.0
New York    1300.0
dtype: float64


Austin         NaN
Chicago        NaN
New York    2600.0
Portland       NaN
dtype: float64

**Nota:** Austin, Chicago y Portlan no se encontraron en ambas _Series_, fueron retornadas con valores NULL/NaN.

Se puede comprobar si un valor es NULL a traves de _isnull_ y _notnull_ .

In [33]:
# devuelve una Serie booleana diciendo cuales no son Null
print(cities.notnull())
print("---------")
print(cities[cities.notnull()])
print("---------")
print(cities[cities.isnull()])

Austin            True
Boston           False
Chicago           True
New York          True
Portland          True
San Francisco     True
dtype: bool
---------
Austin            450.0
Chicago          1000.0
New York         1300.0
Portland          900.0
San Francisco    1100.0
dtype: float64
---------
Boston   NaN
dtype: float64

Se puede usar logica booleana para indexar las ciudades que no son NULL

In [ ]:
# usando logica booleana para indexar las ciudades que no son NULL
print(cities.isnull())
print('\n')
print(cities[cities.isnull()])

## Atributos de objetos Series

Los atributos son estructuras que los objetos contienen para almacenar informacion relativa al objeto en cuestion. Cualquier objeto tiene atributos definidos y se pueden acceder a ellos a traves del _._ y el nombre del atributo en cuestion. Veamos un ejemplo.

In [39]:
d = {'Chicago': 1000, 'New York': 1300, 'Portland': 900, 'San Francisco': 1100,
     'Austin': 450, 'Boston': None}
cities = pd.Series(d)
print(cities)

Austin            450.0
Boston              NaN
Chicago          1000.0
New York         1300.0
Portland          900.0
San Francisco    1100.0
dtype: float64

Podemos consultar los valores que hay en la _Series_ a traves del atributo _values_.

In [23]:
print(cities.values)

[  450.    nan  1000.  1300.   900.  1100.]
 450.0    NaN
NaN       NaN
 1000.0   NaN
 1300.0   NaN
 900.0    NaN
 1100.0   NaN
dtype: float64

De igual forma podemos consultar los valores del indice que hay en la Series a traves del atributo _index_.

In [35]:
print(cities.index)

Index(['Austin', 'Boston', 'Chicago', 'New York', 'Portland', 'San Francisco'], dtype='object')

Y nos permite consultar el tipo de datos que guarda la _Series_ a traves de _dtype_.

In [40]:
print(cities.dtype)

float64

Mira si los elementos del la _Series_ son unicos (no hay repeticiones).

In [41]:
print(cities.is_unique) # mira elementos unicos en los valores
print(cities.index.is_unique) # mira elementos unicos en el indice

False
True

Habras notado que pese a tener elementos no repetidos cuando preguntamos si los valores del _Series_ son unicos la respuesta es False.

In [42]:
cities['Boston'] = 600
print(cities.is_unique)

True

## Metodos de objetos Series

Los metodos son funciones internas que los objetos tienen asociados. Los objetos _Series_ tienen una serie de metodos que nos permitiran realizar calculos en la estructura.

In [6]:
precios = [2.99, 4.45, 1.36]
s = pd.Series(precios)
print(s)

0    2.99
1    4.45
2    1.36
dtype: float64

Podemos realizar la suma de los elementos del la _Series_.

In [ ]:
print(s.sum())

Tambien su multiplicacion.

In [ ]:
print(s.product())

O la media y su desviacion estandar.

In [ ]:
print('La media es: {0}, y la STD es: {1}'.format(s.mean(),s.std()))

O podemos obtener una descripcion de los elementos usando el metodo _describe()_.

In [7]:
print(s.describe())

count    3.000000
mean     2.933333
std      1.545779
min      1.360000
25%      2.175000
50%      2.990000
75%      3.720000
max      4.450000
dtype: float64

Se puede echar un vistazo a los atributos y a los metodos disponibles en una clase usando el tabulador despues del _._.

In [ ]:
s.

### Los metodos `.head()` y `.tail()`

In [45]:
precios = pd.Series(np.arange(5,100,5))

El metodo head() nos va a permitir mostrar los primeros elementos del _Series_. Por defecto muestra 5 elementos aunque le podemos pasar un numero como parametro indicandole cuantos elementos debe mostrar.

In [46]:
print(precios.head())

0     5
1    10
2    15
3    20
4    25
dtype: int32

In [47]:
print(precios.head(8))

0     5
1    10
2    15
3    20
4    25
5    30
6    35
7    40
dtype: int32

El metodo tail() nos va a permitir mostrar los ultimos elementos del Series. Por defecto muestra 5 elementos aunque le podemos pasar un numero como parametro indicandole cuantos elementos debe mostrar.

In [ ]:
precios.tail()

In [48]:
print(precios.tail(8))

11    60
12    65
13    70
14    75
15    80
16    85
17    90
18    95
dtype: int32

### El metodo `.map()`

El metodo _map_ nos va a permitir iterar sobre cada elemento de la serie y aplicar una funcion. Podemos definir la funcion fuera o como vimos en la seccion de funciones a traves de un _lambda_.

In [49]:
precios = pd.Series(np.arange(-10,10,5))

In [50]:
print(precios)

0   -10
1    -5
2     0
3     5
dtype: int32

Vamos a cambiar los valores de precios y poner los negativos a 0 dado que no existen los precios negativos. Para ello nos definimos una funcion que nos permita realizar el cambio y luego la mapearemos.

In [51]:
def to_positive(elem):
    if elem < 0:
        return 0
    else:
        return elem

Ahora al aplicar _map_ se recorre toda la _Series_ y se aplica la funcion definida.

In [52]:
print(precios.map(to_positive))

0    0
1    0
2    0
3    5
dtype: int64

Esto tambien se puede hacer de manera sencilla con _lambda_.

In [71]:
print(precios.map(lambda elem: 0 if elem < 0 else elem))
print(precios)
precios.shape
print(precios.value_counts())

0    0
1    0
2    0
3    5
dtype: int64
0   -10
1    -5
2     0
3     5
dtype: int32
 5     1
-5     1
-10    1
 0     1
dtype: int64

La utilizacion de _map_ es muy poderosa y nos va a permitir realizar y aplicar funciones a nuestros datos de forma rapida y sencilla.

# Dataframe

Puedes pensar en un _Dataframe_ como una estructura de datos tabular que almacena cualquier clase de informacion en filas y columnas. Por hacer un simil, uno podria pensar en un hoja de Excel como algo similar (no es lo mismo pero se parecen).

En realidad un _Dataframe_ no es mas que un conjunto de estructuras _Series_ que comparten un mismo indice (en realidad hay mas pero como aproximacion es valida). Por defecto el indice va de 0 hasta N-1 donde N es el numero de filas del _Dataframe_. Se puede crear de forma manual un _Dataframe_ como sigue.

In [14]:
data = {'year': [2010, 2011, 2012, 2011, 2012, 2010, 2011, 2012],
        'team': ['Barca', 'Barca', 'Barca', 'Madrid', 'Madrid', 'Mallorca', 'Mallorca', 'Mallorca'],
        'wins': [11, 8, 10, 15, 11, 6, 10, 4],
        'losses': [5, 8, 6, 1, 5, 10, 6, 12]}
football = pd.DataFrame(data=data, columns=['year', 'team', 'wins', 'losses'])
# JDA Se puede añadir un índice como a las series
#football = pd.DataFrame(data=data, columns=['year', 'team', 'wins', 'losses'], index=['a', 'b','c', 'd', 'e', 'f', 'g', 'h'])
football.head()

   year    team  wins  losses
0  2010   Barca    11       5
1  2011   Barca     8       8
2  2012   Barca    10       6
3  2011  Madrid    15       1
4  2012  Madrid    11       5

### Algunos metodos y atributos de los DataFrames

Existen una serie de atributos y metodos que son compartidos con los objetos _Series_ y _Numpy_. Por ejemplo, podemos consultar el _index_ y los _values_.

In [25]:
print(football.index)
print(20*'-')
print(football.values)
print(football.index)
print(football.index.is_unique)
print(football.describe)
print(football.head(2))
print(football.tail(2))
print("-"*16)
print(football.axes)
print(football.columns)
print(football.shape)

RangeIndex(start=0, stop=8, step=1)
--------------------
[[2010 'Barca' 11 5]
 [2011 'Barca' 8 8]
 [2012 'Barca' 10 6]
 [2011 'Madrid' 15 1]
 [2012 'Madrid' 11 5]
 [2010 'Mallorca' 6 10]
 [2011 'Mallorca' 10 6]
 [2012 'Mallorca' 4 12]]
RangeIndex(start=0, stop=8, step=1)
True
<bound method NDFrame.describe of    year      team  wins  losses
0  2010     Barca    11       5
1  2011     Barca     8       8
2  2012     Barca    10       6
3  2011    Madrid    15       1
4  2012    Madrid    11       5
5  2010  Mallorca     6      10
6  2011  Mallorca    10       6
7  2012  Mallorca     4      12>
   year   team  wins  losses
0  2010  Barca    11       5
1  2011  Barca     8       8
   year      team  wins  losses
6  2011  Mallorca    10       6
7  2012  Mallorca     4      12
----------------
[RangeIndex(start=0, stop=8, step=1), Index(['year', 'team', 'wins', 'losses'], dtype='object')]
Index(['year', 'team', 'wins', 'losses'], dtype='object')
(8, 4)

Podemos ver la forma de nuestro _DataFrame_ y tambien el tipo de las columnas que contiene y su nombre.

In [57]:
print(football.shape)
print(20*'-')
print(football.columns)
print(20*'-')
print(football.axes)
print(20*'-')
football.dtypes

(8, 4)
--------------------
Index(['year', 'team', 'wins', 'losses'], dtype='object')
--------------------
[RangeIndex(start=0, stop=8, step=1), Index(['year', 'team', 'wins', 'losses'], dtype='object')]
--------------------

year       int64
team      object
wins       int64
losses     int64
dtype: object

Y tambien podemos ver la informacion que hay en el _DataFrame_ a traves del metodo _info_.

In [59]:
football.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
year      8 non-null int64
team      8 non-null object
wins      8 non-null int64
losses    8 non-null int64
dtypes: int64(3), object(1)
memory usage: 336.0+ bytes

Como puedes ver, tenemos columnas con enteros y un tipo object que en _Pandas_ se utiliza para guardar cadenas. Para simplificar puedes pensar en el como un tipo cadena.  

Los metodos head() y tail() tambien se pueden ejecutar en el DataFrame. La funcion _head()_ nos permite explorar las primeras filas del _Dataframe_ y la funcion _tail()_ las ultimas.

In [60]:
football.head()

   year    team  wins  losses
0  2010   Barca    11       5
1  2011   Barca     8       8
2  2012   Barca    10       6
3  2011  Madrid    15       1
4  2012  Madrid    11       5

In [61]:
football.tail()

   year      team  wins  losses
3  2011    Madrid    15       1
4  2012    Madrid    11       5
5  2010  Mallorca     6      10
6  2011  Mallorca    10       6
7  2012  Mallorca     4      12

De forma analoga a los _Series_ podemos obtener una descripcion de las columnas numericas del _DataFrame_.

In [62]:
football.describe()

              year       wins     losses
count     8.000000   8.000000   8.000000
mean   2011.125000   9.375000   6.625000
std       0.834523   3.377975   3.377975
min    2010.000000   4.000000   1.000000
25%    2010.750000   7.500000   5.000000
50%    2011.000000  10.000000   6.000000
75%    2012.000000  11.000000   8.500000
max    2012.000000  15.000000  12.000000

### Lectura de un DataFrame

Ya ves que el metodo _head_ funciona y esto es porque debajo del dataframe tenemos _Series_ corriendo. Es mucho mas habitual leer un _Dataframe_ desde un fichero de texto _csv_ con la funcion de _Pandas_ *pd.read_csv*

In [63]:
df_nba = pd.read_csv('pandas/nba.csv')
df_nba.head() # por defecto 5 lineas

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

### Accediendo a las columnas

Se puede acceder a las columnas a traves del operador de indexacion _[ ]_ o el operador _._ .

In [64]:
# Acceso a la columna salary con el punto
df_nba.Salary.head()

0    7730337.0
1    6796117.0
2          NaN
3    1148640.0
4    5000000.0
Name: Salary, dtype: float64

El operador de indexacion con corchetes es mas versatil y permite acceder a mas de una columna y columnas con nombres que tienen espacios.

In [66]:
# Acceso a la columna salary con [ ]
print(type(df_nba['Salary']))
df_nba['Salary'].head()

<class 'pandas.core.series.Series'>

0    7730337.0
1    6796117.0
2          NaN
3    1148640.0
4    5000000.0
Name: Salary, dtype: float64

Para acceder a dos o mas columnas se pone el nombre de las columnas encerrado en una lista.

In [67]:
# Acceso a la columna name, salary [ ]
print(type(df_nba[['Name', 'Salary']]))
df_nba[['Name', 'Salary']].head()

<class 'pandas.core.frame.DataFrame'>

            Name     Salary
0  Avery Bradley  7730337.0
1    Jae Crowder  6796117.0
2   John Holland        NaN
3    R.J. Hunter  1148640.0
4  Jonas Jerebko  5000000.0

In [68]:
df_nba[['Salary', 'Name', 'Team']].head()

      Salary           Name            Team
0  7730337.0  Avery Bradley  Boston Celtics
1  6796117.0    Jae Crowder  Boston Celtics
2        NaN   John Holland  Boston Celtics
3  1148640.0    R.J. Hunter  Boston Celtics
4  5000000.0  Jonas Jerebko  Boston Celtics

Existe un metodo que viene de las _Series_ que nos permite contar cuantas ocurrencias de cada elemento aparecen en nuestro _DataFrame_. Solo actua sobre una columna a cada vez, intentarlo con dos nos dara error.

In [69]:
# cuenta los jugadores que hay que cada position
df_nba['Position'].value_counts()

SG    102
PF    100
PG     92
SF     85
C      78
Name: Position, dtype: int64

### Agregando una columna nueva

Agregar una nueva columna a un _DataFrame_ es muy sencillo. Es tan sencillo como indicar el nombre de la columna y asignarle un valor.

In [72]:
df_nba = pd.read_csv('pandas/nba.csv')
df_nba.head() # por defecto 5 lineas

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [ ]:
# Vamos a crear una nueva columna
df_nba['Sport'] = 'Basket'
df_nba.head()

Como puedes ver la columna se inserta al final del _DataFrame_. Para poder insertar la nueva columna en una posicion determinada debemos usar el metodo _insert_.

In [ ]:
df_nba = pd.read_csv('pandas/nba.csv')
df_nba.head() # por defecto 5 lineas

In [ ]:
# df_nba(posicion, column_name, value)
df_nba.insert(2, 'Sport', 'Basket')

df_nba.head()

Ahora la columna esta en la posicion que nosotros le hemos indicado.

### Modificando los valores de una columna

Una columna puede ser modificada de forma sencilla seleccionandola y asignandole un nuevo valor.

In [76]:
# pongamos que la nba en realidad es baseball...
df_nba['Sport'] = 'Baseball'
df_nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Sport,Weight_kg
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,Baseball,81.646560
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,Baseball,106.594120
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,Baseball,92.986360
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,Baseball,83.914520
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0,Baseball,104.779752

Tambien se puede modificar valores en base a otra columna. El peso esta en libras, vamos a cambiarlo a KG y crear una nueva columna.

In [74]:
lb2kg = 0.453592 # una libra son 0.453592 kg
df_nba['Weight_kg'] = df_nba['Weight'] * lb2kg
df_nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Sport,Weight_kg
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,Baseball,81.646560
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,Baseball,106.594120
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,Baseball,92.986360
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,Baseball,83.914520
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0,Baseball,104.779752

### Eliminando valores *Null* con `.dropna()`

In [140]:
df_nba = pd.read_csv('pandas/nba.csv')

Probablemente a estas altura te habras dado cuenta que el salario de la tercera columna esta representado como *NaN*. Esto es lo que conocemos como missing o Null values. En Excel, esa celda apareceria vacia. Este tipo de valores pueden representar un problema cuando analizamos datos de modo que los podemos eliminar usando el metodo *dropna*.

In [75]:
# Eliminamos las filas que tienen uno o mas Null values
# Observa como la fila con indice 2 desaparece porque tiene un Null en el Salario
print(df_nba.dropna(how='any').shape)
df_nba.dropna(how='any').head()

(364, 11)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Sport,Weight_kg
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,Baseball,81.646560
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,Baseball,106.594120
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,Baseball,83.914520
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0,Baseball,106.594120
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0,Baseball,107.954896

Tambien podemos eliminar columnas usando el parametro _axis_. Por defecto Python intenta eliminar filas (axis=0) pero podemos eliminar las columnas que tengan un valor Null.

In [ ]:
# College y Salary se eliminan
print(df_nba.dropna(axis=1).shape)
df_nba.dropna(axis=1).head()

Tambien podemos querer eliminar aquellas fillas que tengan un Null en una columna en concreto usando el parametro _subset_.

In [ ]:
# Solo eliminamos las filas con Nulls en Salary
print(df_nba.dropna(subset=['Salary']).shape)
df_nba.dropna(subset=['Salary']).head()

### Rellenando los valores Null con `.fillna()`

Una alternativa a la eliminacion de _missing_ values es su sustitucion por valores. Esto en Python se puede hacer a traves del metodo _fillna_.

In [ ]:
df_nba = pd.read_csv('pandas/nba.csv')

In [155]:
# sustituimos el salario por 0 y lo guardamos en el DataFrame a traves del parametro inplace
df_nba['Salary'].fillna(0, inplace=True)
df_nba['College'].fillna('N/A', inplace=True)

In [ ]:
df_nba.head()

Y si queremos substituirlo por la media de los valores. Es sencillo hacer uso de los metodos para ello.

In [ ]:
df_nba = pd.read_csv('pandas/nba.csv')
df_nba['Salary'].fillna(int(df_nba['Salary'].mean()), inplace=True)
df_nba.head()

### Cambiando los tipos de las columnas con `.astype()`

In [ ]:
df_nba = pd.read_csv("pandas/nba.csv").dropna(how = "all")
df_nba["Salary"].fillna(0, inplace = True)
df_nba["College"].fillna("None", inplace = True)
df_nba.head(3)

In [ ]:
df_nba.info()

Podemos cambiar la columnas de edad, salario y numero a enteros para que sus tipos sean los adecuados.

In [177]:
df_nba["Salary"] = df_nba["Salary"].astype("int") # cambiamos columna salario a entero

In [ ]:
df_nba.head(3)

In [ ]:
df_nba["Number"] = df_nba["Number"].astype("int") # a entero
df_nba["Age"] = df_nba["Age"].astype("int") # a entero
df_nba.head(3)

En cualquier momento podemos volver a cambiarlos a tipo _float_.

In [166]:
df_nba["Salary"] = df_nba["Salary"].astype("float") # cambiamos columna salario a float

Existen columna que contienen pocos elementos distintos. Por ejemplo, la columna Position solo contiene 5 elementos que son las posiciones que existen en la pista de baloncesto. Estos elementos se puede representar de una manera mas eficiente que como tipo _object_ si los cambiamos a categorias.

In [80]:
df_nba["Position"] = df_nba["Position"].astype("category")
df_nba["Team"] = df_nba["Team"].astype("category")
df_nba.head(3)
df_nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 457 entries, 0 to 456
Data columns (total 11 columns):
Name         457 non-null object
Team         457 non-null category
Number       457 non-null float64
Position     457 non-null category
Age          457 non-null float64
Height       457 non-null object
Weight       457 non-null float64
College      373 non-null object
Salary       446 non-null float64
Sport        457 non-null object
Weight_kg    457 non-null float64
dtypes: category(2), float64(5), object(4)
memory usage: 34.8+ KB

A la vista no cambia nada pero si accedemos a la informacion podemos ver como hemos ahorrado un 8% de memoria que te permitira cargar mas datos para tus analisis.

### Ordenando el DataFrame `.sort_values()`

La ordenacion de un _DataFrame_ en base a una columna o columnas es un elemento muy potente que nos va a ser muy util cuando realicemos analisis.

In [81]:
df_nba = pd.read_csv("pandas/nba.csv")

Veamos quienes son los 5 jugadores que menos cobran de la NBA.

In [82]:
df_nba.sort_values('Salary').head(5)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
32,Thanasis Antetokounmpo,New York Knicks,43.0,SF,23.0,6-7,205.0,NaN,30888.0
291,Orlando Johnson,New Orleans Pelicans,0.0,SG,27.0,6-5,220.0,UC Santa Barbara,55722.0
130,Phil Pressey,Phoenix Suns,25.0,PG,25.0,5-11,175.0,Missouri,55722.0
135,Alan Williams,Phoenix Suns,15.0,C,23.0,6-8,260.0,UC Santa Barbara,83397.0
175,Jordan McRae,Cleveland Cavaliers,12.0,SG,25.0,6-5,179.0,Tennessee,111196.0

Y si queremos saber los que mas cobran?. Podemos utilizar el parametro _ascending=False_ (por defecto es True).

In [84]:
df_nba.sort_values('Salary', ascending=False).head(5)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
109,Kobe Bryant,Los Angeles Lakers,24.0,SF,37.0,6-6,212.0,NaN,25000000.0
169,LeBron James,Cleveland Cavaliers,23.0,SF,31.0,6-8,250.0,NaN,22970500.0
33,Carmelo Anthony,New York Knicks,7.0,SF,32.0,6-8,240.0,Syracuse,22875000.0
251,Dwight Howard,Houston Rockets,12.0,C,30.0,6-11,265.0,NaN,22359364.0
339,Chris Bosh,Miami Heat,1.0,PF,32.0,6-11,235.0,Georgia Tech,22192730.0

Esto se puede combinar de multiples formas y agregar mas columnas y con simples reordenamientos ya podemos comenzar a realizar pequenios analisis.

In [83]:
# Primero ordena por edad y luego por salario
df_nba.sort_values(['Age', 'Salary'], ascending=[True, False]).head(5)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
122,Devin Booker,Phoenix Suns,1.0,SG,19.0,6-6,206.0,Kentucky,2127840.0
226,Rashad Vaughn,Milwaukee Bucks,20.0,SG,19.0,6-6,202.0,UNLV,1733040.0
410,Karl-Anthony Towns,Minnesota Timberwolves,32.0,C,20.0,7-0,244.0,Kentucky,5703600.0
116,D'Angelo Russell,Los Angeles Lakers,1.0,PG,20.0,6-5,195.0,Ohio State,5103120.0
56,Jahlil Okafor,Philadelphia 76ers,8.0,C,20.0,6-11,275.0,Duke,4582680.0

Por defecto los valores _Null_ se van al final aunque podemos cambiar este comportamiento. El parametro *na_position* nos ayudara a ello.

In [ ]:
df_nba.sort_values('Salary').tail(3)

In [ ]:
df_nba.sort_values('Salary', na_position='first').tail(3)

### Ordenando el DataFrame `.sort_index()`

Cuando ordenamos en base a los valores nuestro _Dataframe_ desordena los indices que tenemos. Si queremos volver al estado inicial podemos usar *sort_index()*.

In [192]:
df_nba = pd.read_csv("pandas/nba.csv")
df_nba = df_nba.sort_values(['Age', 'Salary'], ascending=[True, False])
# nuestro DataFrame tiene los indices desordenados
df_nba.head(5)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
122,Devin Booker,Phoenix Suns,1.0,SG,19.0,6-6,206.0,Kentucky,2127840.0
226,Rashad Vaughn,Milwaukee Bucks,20.0,SG,19.0,6-6,202.0,UNLV,1733040.0
410,Karl-Anthony Towns,Minnesota Timberwolves,32.0,C,20.0,7-0,244.0,Kentucky,5703600.0
116,D'Angelo Russell,Los Angeles Lakers,1.0,PG,20.0,6-5,195.0,Ohio State,5103120.0
56,Jahlil Okafor,Philadelphia 76ers,8.0,C,20.0,6-11,275.0,Duke,4582680.0

In [ ]:
# reordenacion del indice de menor a mayor
df_nba.sort_index().head(3)

In [ ]:
# reordenacion de mayor a menor
df_nba.sort_index(ascending=False).head(3)

### Rankeando el DataFrame `.rank()`

Un metodo interesante que nos permite realizar un ranking de los jugadores mejor pagados es _rank()_.

In [85]:
df_nba = pd.read_csv("pandas/nba.csv").dropna(how = "all")
df_nba["Salary"] = df_nba["Salary"].fillna(0).astype("int")
df_nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0

In [89]:
# ranking de mayor a menor de los salarios de jugadores
# creamos nueva columna
df_nba['Salary Rank'] = df_nba['Salary'].rank(ascending = False).astype('int')
df_nba.head(10)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Salary Rank
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337,97
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117,110
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0,452
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640,322
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000,147
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000,57
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960,316
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160,253
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360,272
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040,190

Vamos a comprobar que todo funcionando ordenando el _DataFrame_.

In [90]:
df_nba.sort_values('Salary', ascending=False).head(20)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Salary Rank
109,Kobe Bryant,Los Angeles Lakers,24.0,SF,37.0,6-6,212.0,NaN,25000000,1
169,LeBron James,Cleveland Cavaliers,23.0,SF,31.0,6-8,250.0,NaN,22970500,2
33,Carmelo Anthony,New York Knicks,7.0,SF,32.0,6-8,240.0,Syracuse,22875000,3
251,Dwight Howard,Houston Rockets,12.0,C,30.0,6-11,265.0,NaN,22359364,4
339,Chris Bosh,Miami Heat,1.0,PF,32.0,6-11,235.0,Georgia Tech,22192730,5
100,Chris Paul,Los Angeles Clippers,3.0,PG,31.0,6-0,175.0,Wake Forest,21468695,6
414,Kevin Durant,Oklahoma City Thunder,35.0,SF,27.0,6-9,240.0,Texas,20158622,7
164,Derrick Rose,Chicago Bulls,1.0,PG,27.0,6-3,190.0,Memphis,20093064,8
349,Dwyane Wade,Miami Heat,3.0,SG,34.0,6-4,220.0,Marquette,20000000,9
174,Kevin Love,Cleveland Cavaliers,0.0,PF,27.0,6-10,251.0,UCLA,19689000,11
98,DeAndre Jordan,Los Angeles Clippers,6.0,C,27.0,6-11,265.0,Texas A&M,19689000,11
23,Brook Lopez,Brooklyn Nets,11.0,C,28.0,7-0,275.0,Stanford,19689000,11
294,LaMarcus Aldridge,San Antonio Spurs,12.0,PF,30.0,6-11,240.0,Texas,19689000,11
265,Marc Gasol,Memphis Grizzlies,33.0,C,31.0,7-1,255.0,NaN,19688000,14
96,Blake Griffin,Los Angeles Clippers,32.0,PF,27.0,6-10,251.0,Oklahoma,18907726,15
315,Paul Millsap,Atlanta Hawks,4.0,PF,31.0,6-8,246.0,Louisiana Tech,18671659,16
199,Paul George,Indiana Pacers,13.0,SF,26.0,6-9,220.0,Fresno State,17120106,17
426,Russell Westbrook,Oklahoma City Thunder,0.0,PG,27.0,6-3,200.0,UCLA,16744218,18
168,Kyrie Irving,Cleveland Cavaliers,2.0,PG,24.0,6-3,193.0,Duke,16407501,19
233,Wesley Matthews,Dallas Mavericks,23.0,SG,29.0,6-5,220.0,Marquette,16407500,22

Lo interesante de todo esto es que valores iguales tendran el mismo ranking.

### Filtrando  `DataFrames` en base a una o mas condiciones

Vamos a ver como se puede realizar una seleccion precisa de valores en nuestro _DataFrame_ en base a una condicion.

In [93]:
df = pd.read_csv("pandas/employees.csv", parse_dates = ["Start Date", "Last Login Time"])
# convertimos Senior Management en bool
df["Senior Management"] = df["Senior Management"].astype("bool")
# cambiamos a category el genero que solo tiene dos valores distintos
df["Gender"] = df["Gender"].astype("category")
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2018-02-02 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2018-02-02 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2018-02-02 11:17:00,130590,11.858,False,Finance

Para ello se utiliza los operadores logicos y creamos unas variables de filtrado. **El filtrado en el fondo no es mas que una indexacion booleana que accede a las filas donde las mascaras de filtrado son True.**

In [94]:
mask1 = df["Gender"] == "Male"
mask2 = df["Team"] == "Marketing"
# recupera aquellos empleados que sean hombres y cuyo equipo sea marketing
df[mask1 & mask2].head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2018-02-02 12:42:00,97308,6.945,True,Marketing
21,Matthew,Male,1995-09-05,2018-02-02 02:12:00,100612,13.645,False,Marketing
26,Craig,Male,2000-02-27,2018-02-02 07:45:00,37598,7.757,True,Marketing
74,Thomas,Male,1995-06-04,2018-02-02 14:24:00,62096,17.029,False,Marketing
77,Charles,Male,2004-09-14,2018-02-02 20:13:00,107391,1.260,True,Marketing

O en una linea.

In [97]:
df[(df["Gender"] == "Male") & (df["Team"] == "Marketing")].head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2018-02-02 12:42:00,97308,6.945,True,Marketing
21,Matthew,Male,1995-09-05,2018-02-02 02:12:00,100612,13.645,False,Marketing
26,Craig,Male,2000-02-27,2018-02-02 07:45:00,37598,7.757,True,Marketing
74,Thomas,Male,1995-06-04,2018-02-02 14:24:00,62096,17.029,False,Marketing
77,Charles,Male,2004-09-14,2018-02-02 20:13:00,107391,1.260,True,Marketing

El codigo anterior realizar un filtrado en base a dos condiciones que se han de cumplir utilizando el operador & que realiza un filtrado AND elemento a elemento en las _Series_. El siguiente lo hace en base a que una de las condiciones se cumplan. Esto se hace en base al operador | que hace las veces de OR.

In [98]:
# empleados que son hombres, o trabajan en marketing o ambos
df[(df["Gender"] == "Male") & (df["Team"] == "Marketing")].head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2018-02-02 12:42:00,97308,6.945,True,Marketing
21,Matthew,Male,1995-09-05,2018-02-02 02:12:00,100612,13.645,False,Marketing
26,Craig,Male,2000-02-27,2018-02-02 07:45:00,37598,7.757,True,Marketing
74,Thomas,Male,1995-06-04,2018-02-02 14:24:00,62096,17.029,False,Marketing
77,Charles,Male,2004-09-14,2018-02-02 20:13:00,107391,1.260,True,Marketing

Las condiciones de filtrado se pueden aplicar usando cualquiera de los operadores de comparacion que conocemos.

In [ ]:
# salarios > 100000 $
df[(df["Salary"] > 100000)].head()

In [ ]:
# salarios > 100000 $ y que no son senior management
df[(df["Salary"] > 100000) & (df["Senior Management"] == False)].head()

Las combinaciones son infinitas y podemos obtener cualquier tipo de informacion. Por ejemplo.

In [99]:
mask1 = df["First Name"] == "Robert"
mask2 = df["Team"] == "Client Services"
mask3 = df["Start Date"] > "2016-06-01"

# recoge a Robert de Client Services 
#y aquellos empleados que empezaron despues de la fecha marcada
df[(mask1 & mask2) | mask3]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
15,Lillian,Female,2016-06-05,2018-02-02 06:09:00,59414,1.256,False,Product
98,Tina,Female,2016-06-16,2018-02-02 19:47:00,100705,16.961,True,Marketing
387,Robert,Male,1994-10-29,2018-02-02 04:26:00,123294,19.894,False,Client Services
451,Terry,NaN,2016-07-15,2018-02-02 00:29:00,140002,19.490,True,Marketing

### El metodo `.isin()`

In [ ]:
df = pd.read_csv("employees.csv", parse_dates = ["Start Date", "Last Login Time"])
df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("category")
df.head(3)

Que ocurre si queremos filtrar en base a varios valores de una columna.

In [ ]:
mask1 = df["Team"] == "Legal"
mask2 = df["Team"] == "Sales"
mask3 = df["Team"] == "Product"

df[mask1 | mask2 | mask3].head()

El metodo _isin( )_ simplifica de forma significativa esta operacion. Ahora ya vamos con la forma pythonica.

In [ ]:
df[df['Team'].isin(['Legal','Sales','Product'])].head()

### Los metodos `.isnull()` y `.notnull()`

Estos dos metodos complementarios nos van a permitir filtrar aquellas filas que tengan valores Null o las que no los tengan en base al indexado booleano.

In [ ]:
# filas con el departamento Null (desconocido)
mask = df["Team"].isnull()

df[mask].head()

In [ ]:
# filas cuyo genero es conocido
condition = df["Gender"].notnull()

df[condition].head()

### El metodo `.between()`

Este metodo nos facilitara la vida para realizar un filtrado por rango de valores.

In [ ]:
# aquellos que cobran entre (60000, 70000)
df[df["Salary"].between(60000, 70000)].head()

In [ ]:
# aquellos con un bonus entre 2% y 5%
df[df["Bonus %"].between(2.0, 5.0)].head()

In [ ]:
# o podemos seleccionar los empleados en que empezaron rango de fechas
df[df["Start Date"].between("1991-01-01", "1992-01-01")].head()

In [ ]:
# podemos chequear quienes se logearon entre las 8.30 y las 12 del mediodia
df[df["Last Login Time"].between("08:30AM", "12:00PM")]

### El methodo `.duplicated()`

In [100]:
df = pd.read_csv("pandas/employees.csv", parse_dates = ["Start Date", "Last Login Time"])
df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("category")
df.sort_values("First Name", inplace = True)
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2018-02-02 10:20:00,61602,11.849,True,Marketing
327,Aaron,Male,1994-01-29,2018-02-02 18:48:00,58755,5.097,True,Marketing
440,Aaron,Male,1990-07-22,2018-02-02 14:53:00,52119,11.343,True,Client Services

Este metodo nos servira extraer las filas repetidas en nuestro DataFrame. Por defecto si no ponemos nada, Pandas guarda la fila con el primer duplicado y nos devuelve el resto de duplicados.

In [101]:
df[df["First Name"].duplicated(keep='first')].head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
327,Aaron,Male,1994-01-29,2018-02-02 18:48:00,58755,5.097,True,Marketing
440,Aaron,Male,1990-07-22,2018-02-02 14:53:00,52119,11.343,True,Client Services
937,Aaron,NaN,1986-01-22,2018-02-02 19:39:00,63126,18.424,False,Client Services
141,Adam,Male,1990-12-24,2018-02-02 20:57:00,110194,14.727,True,Product
302,Adam,Male,2007-07-05,2018-02-02 11:59:00,71276,5.027,True,Human Resources

Podemos cambiar esto para que nos guarde el ultimo duplicado y nos devuelva el resto.

In [102]:
df[df["First Name"].duplicated(keep='last')].head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2018-02-02 10:20:00,61602,11.849,True,Marketing
327,Aaron,Male,1994-01-29,2018-02-02 18:48:00,58755,5.097,True,Marketing
440,Aaron,Male,1990-07-22,2018-02-02 14:53:00,52119,11.343,True,Client Services
137,Adam,Male,2011-05-21,2018-02-02 01:45:00,95327,15.120,False,Distribution
141,Adam,Male,1990-12-24,2018-02-02 20:57:00,110194,14.727,True,Product

Si queremos acceder a aquellos registros que NO tienen duplicados lo podemos hacer de la siguiente manera. En este caso le indicamos a Pandas que no se guarde ningun duplicado y luego con el operador de NOT (de negacion) ~ invertimos el resultado.

In [ ]:
# ~ hace que el resultado booleano se invierta y nos quedemos con los no duplicados
df[~df["First Name"].duplicated(keep = False)].head()

**Cuidado que este metodo solo se puede aplicar en una columna (un objeto _Series_)**

### El metodo `.drop_duplicates()`

In [108]:
df = pd.read_csv("pandas\employees.csv", parse_dates = ["Start Date", "Last Login Time"])
df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("category")
df.sort_values("First Name", inplace = True)
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2018-02-02 10:20:00,61602,11.849,True,Marketing
327,Aaron,Male,1994-01-29,2018-02-02 18:48:00,58755,5.097,True,Marketing
440,Aaron,Male,1990-07-22,2018-02-02 14:53:00,52119,11.343,True,Client Services

Este metodo es la version de _DataFrame_ para eliminar duplicados. 

Si no indicamos nada *drop_duplicates* intentara eliminar las filas que sean tengan todos los valores de sus columnas identicas. Si esto no ocurre, no eliminara ninguna.

In [ ]:
# no existen filas duplicadas
#que tengan todas las columnas iguales
print(len(df.drop_duplicates()))
print(len(df))

Podemos sin embargo especificar una columna con duplicados y actuar sobre ella.

In [ ]:
# elimina todos los duplicados de la columna nombre y guarda el primero
df.drop_duplicates(subset = ["First Name"], keep = 'first').head()

In [ ]:
# elimina todos los duplicados de la columna nombre y guarda el ultimo
df.drop_duplicates(subset = ["First Name"], keep = 'last').head()

Y podemos especificar mas de una columna sobre la que actuar.

In [ ]:
# elimina todos los duplicados de la columna nombre y team guarda el ultimo
df.drop_duplicates(subset = ["First Name", "Team"], keep = 'primero').head()

### Los metodos `.unique()` y `.nunique()`

In [109]:
df = pd.read_csv("pandas/employees.csv", parse_dates = ["Start Date", "Last Login Time"])
df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("category")
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2018-02-02 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2018-02-02 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2018-02-02 11:17:00,130590,11.858,False,Finance

Estos metodos nos permiten identificar aquellos valores unicos de las diferentes columnas que tenemos en nuestro DataFrame. Es un metodo que actual a nivel de columna (_Series_) de modo que si lo invocamos con mas de una columna obtendremos un error.

In [110]:
print(df["Gender"].unique())
print(len(df["Gender"].unique()))

[Male, Female, NaN]
Categories (2, object): [Male, Female]
3

In [114]:
print(df["Team"].unique())
print('Existen {0} departamentos en la empresa.'.format(len(df["Team"].unique())))

['Marketing' nan 'Finance' 'Client Services' 'Legal' 'Product'
 'Engineering' 'Business Development' 'Human Resources' 'Sales'
 'Distribution']
Existen 11 departamentos en la empresa.

Una manera mas elegante de calcular el numero de valores unicos es directamente a traves de la funcion _nunique_. **Cuidado con esta funcion que excluye en su cuenta por defecto los Nulls.**

In [112]:
print('Existen {0} nombres distintos de empleados en la empresa.'.format(
    df["First Name"].nunique(dropna = True)))
print('Existen {0} departamentos en la empresa.'.format(
    df["Team"].nunique(dropna = False)))

Existen 200 nombres distintos de empleados en la empresa.
Existen 11 departamentos en la empresa.

Al igual que en el modulo _Numpy_ se pueden realizar operaciones de forma muy sencilla con el indexado booleano

In [ ]:
print 'Mean Poblacion', nuc_pob['Poblacion'].mean()
print 'STD Poblacion', nuc_pob['Poblacion'].std()
print 'Min Poblacion', nuc_pob['Poblacion'].min()
print 'Max Poblacion', nuc_pob['Poblacion'].max()

Y se pueden combinar las operaciones para obtener resultados mas interesantes

In [ ]:
nuc_pob[nuc_pob['Poblacion'] >50000].head()

In [ ]:
nuc_pob[(nuc_pob['Poblacion'] >50000) & (nuc_pob['Provincia'] == 'Granada') ].head()

Ordenar los valores en base a una columna nunca fue tan sencillo

In [ ]:
nuc_pob.sort_values('Poblacion', ascending = False).head() # si pones ascending = True los ordena en orden ascendente

Puedes resetear el indice para que despues de ordenarlos cambie. Observa como cambia el indice y ahora se ha reseteado y aparece el nuevo indice con las ciudades ordenadas.

In [ ]:
# Esto puede servirte muy util para ordenar y encontrar luego posiciones
nuc_pob.sort_values('Poblacion', ascending = False).reset_index(drop=True).head() # con drop nos deshacemos del antiguo indice

# Ejercicios

### Jugando nucleos de poblacion

El dataset se compone de:
- FID: es in identificador de numero linea lo puedes ignorar
- Texto: nombre de la poblacion
- Poblacion: numero de habitantes
- CodMun: codigo postal
- Municipio: nombre del municipio (usa este para los ejercicios)
- CodProvin: codigo provincia
- Provincia: nombre de la provincia
- X: Longitud en grados
- Y: Latitud en grados

1 - Carga el fichero 'NucleosPoblacion.csv' explora con las funciones _head_ y _tail_ el principio y el final.

In [1]:
import pandas as pd
nuc_pob = pd.read_csv('pandas/NucleosPoblacion.csv')
nuc_pob.head(5)

,FID,OBJECTID,Texto,Poblacion,CodMun,Municipio,CodProvin,Provincia,X,Y
0,0,1,Agüimes,29431.0,35002,Agüimes,35,Las Palmas,-15.446012,27.900542
1,1,2,Antigua,10458.0,35003,Antigua,35,Las Palmas,-14.013301,28.418966
2,2,3,Arrecife,58156.0,35004,Arrecife,35,Las Palmas,-13.551451,28.960649
3,3,4,Arucas,36745.0,35006,Arucas,35,Las Palmas,-15.521512,28.117496
4,4,5,Gáldar,24473.0,35009,Gáldar,35,Las Palmas,-15.654111,28.143873

In [3]:
nuc_pob.tail(5)

,FID,OBJECTID,Texto,Poblacion,CodMun,Municipio,CodProvin,Provincia,X,Y
847,847,848,Infante Juan Manuel,14192.0,30030,Murcia,30,Murcia,-1.124304,37.979033
848,848,849,Santa Maria de Gracia,13349.0,30030,Murcia,30,Murcia,-1.202069,37.984024
849,849,850,Vista Alegre,15208.0,30030,Murcia,30,Murcia,-1.130564,37.995715
850,850,851,Poligono Sta M de Benquerencia,19177.0,45168,Toledo,45,Toledo,-3.948364,39.866699
851,851,852,Grao,16367.0,12040,Castellón de la Plana/Castelló de la Plana,12,Castelló/Castellón,0.012911,39.973568

2 - Cual es la ciudad mas poblada?

In [31]:
#Metodo 1
nuc_pob2 = nuc_pob.groupby(["Municipio"]).agg({"Poblacion":["sum"]}).reset_index()
nuc_pob2.columns = ["Municipio", "Poblacion"]
nuc_pob2.sort_values("Poblacion", ascending=False).head(1)["Municipio"]

#Metodo 2
#nuc_pob[["Municipio", "Poblacion"]].groupby("Municipio").sum().sort_values("Poblacion", ascending=False).head(1).index[0]

389    Madrid
Name: Municipio, dtype: object

3 - Que posicion ocupa Granada en las mas pobladas?. La funcion *sort_values* puede ayudarte en tu cometido

In [4]:
# Sin indice
nuc_pob2 = nuc_pob[["Municipio", "Poblacion"]].groupby("Municipio").sum().reset_index()
nuc_pob2.sort_values("Poblacion", ascending=False, inplace=True)
nuc_pob2["PobRank"] = nuc_pob2["Poblacion"].rank(ascending=False)
nuc_pob2[nuc_pob2["Municipio"] == "Granada"]

# Con indice (creado de forma auto por groupBy)
nuc_pob2 = nuc_pob[["Municipio", "Poblacion"]].groupby("Municipio").sum()
nuc_pob2['Poblacion Rank'] = nuc_pob2['Poblacion'].rank(ascending = False).astype('int')
nuc_pob2.head(5)
print(nuc_pob2.sort_values("Poblacion Rank", ascending=False).loc["Granada"]["Poblacion Rank"])

20.0

4 - Escribe el nombre de los 10 municipios con menor poblacion

In [7]:
import pandas as pd
nuc_pob = pd.read_csv('pandas/NucleosPoblacion.csv')

nuc_pob2 = nuc_pob[["Municipio", "Poblacion"]].groupby("Municipio").sum().sort_values("Poblacion", ascending=True).head(10)
nuc_pob2
#.reset_index()
#nuc_pob2.sort_values("Poblacion", ascending=True).head(10)

                Poblacion
Municipio
Zumarraga         10037.0
Caldas de Reis    10045.0
Amurrio           10050.0
Premià de Dalt    10064.0
Buñol             10077.0
Bembibre          10097.0
Ocaña             10098.0
Sax               10099.0
Xinzo de Limia    10245.0
Reinosa           10277.0

5 - Cuantos municipios en Extremadura tienen mas de 50000 habitantes?

In [13]:
nuc_pob2 = nuc_pob[["Provincia", "Municipio", "Poblacion"]].groupby(["Provincia","Municipio"]).sum().reset_index()
#mask1 = nuc_pob2["Provincia"].isin(["Badajoz", "Caceres"])
#mask2 = nuc_pob2["Poblacion"] > 50000
nuc_pob2[nuc_pob2["Provincia"].isin(["Badajoz", "Caceres"]) & (nuc_pob2["Poblacion"] > 50000) ].sort_values("Poblacion", ascending=True).head(10)

    Provincia Municipio  Poblacion
104   Badajoz    Mérida    57127.0
101   Badajoz   Badajoz   150376.0

6 - ¿Cuál es el municipio situado más al Norte? (Usar el valor de la coordenada "Y" que representa la latitud en grados). Proporcione también la provincia a la que pertenece y su población.

In [71]:
nuc_pob.sort_values(["Y"], ascending=False)[["Municipio", "Provincia"]].head(1)

    Municipio Provincia
104   Viveiro      Lugo

7 - ¿Cual es el municipio de la provincia de Granada situado más al Este?. ¿Cual es el situado más al Oeste?.

In [87]:
granadaPob = nuc_pob[nuc_pob["Provincia"] == "Granada"].sort_values(["X"], ascending=False)[["Municipio", "Provincia"]]
print("Al Este: " + granadaPob.head(1)["Municipio"].values[0])
print("Al Oeste: " + granadaPob.tail(1)["Municipio"].values[0])

Al Este: Baza
Al Oeste: Loja

8 - ¿Cuántos Municipios hay en un radio de 5 grados de la ciudad de Barcelona?.

In [108]:
import math

barcelona = nuc_pob[nuc_pob["Municipio"] == "Barcelona"].head(1)
xBarcelona = barcelona["X"].values[0]
yBarcelona = barcelona["Y"].values[0]
nuc_pob["dist_barc"] = nuc_pob.apply(lambda row: math.sqrt((xBarcelona-row["X"])**2 + (yBarcelona -row["Y"])**2), axis = "columns")
nuc_pob[nuc_pob["dist_barc"] < 5]["Municipio"].count()

357

9 - Obtenga la media, mediana, desviación estándar, valor máximo y valor mínimo de la población de los municipios de la provincia de Granada

In [112]:
nuc_pob[nuc_pob["Provincia"] == "Granada"]["Poblacion"].describe()

count        20.000000
mean      30217.850000
std       50355.491715
min       10386.000000
25%       13146.500000
50%       17526.000000
75%       21739.750000
max      239154.000000
Name: Poblacion, dtype: float64

### Volviendo al estudio del performance de los estudiantes ahora con DataFrames"

La descripcion del dataset es el siguiente, en columnas (recuerda que las columnas en Python empiezan en 0):

- 1: school - student's school (binary: 0 - Gabriel Pereira or 1 - Mousinho da Silveira) 
- 2: sex - student's sex (binary: 0 - female or 1 - male) 
- 3: age - student's age (numeric: from 15 to 22) 
- 4: address - student's home address type (binary: 0 - urban or 1 - rural) 
- 5: famsize - family size (binary: 0 - greater than 3 or 1 - less or equal to 3) 
- 6: Pstatus - parent's cohabitation status (binary: 0 - apart or 1 - living together) 
- 7: Medu - mother's education (numeric: 0 - none, 1 - primary education (4th grade), 2 - 5th to 9th grade, 3 - secondary education or 4 - higher education) 
- 8: Fedu - father's education (numeric: 0 - none, 1 - primary education (4th grade), 2 - 5th to 9th grade, 3 - secondary education or 4 - higher education) 
- 9: traveltime - home to school travel time (numeric: 1 - 15 min., 2 - 15 to 30 min., 3 - 30 min. to 1 hour, or 4 - more than 1 hour) 
- 10: studytime - weekly study time (numeric: 1 - less than 2 hours, 2 - 2 to 5 hours, 3 - 5 to 10 hours, or 4 - more than 10 hours) 
- 11: failures - number of past class failures (numeric: n if 1 less,equal than 3, else 4) 
- 12: schoolsup - extra educational support (binary: 1 - yes or 0 - no) 
- 13: famsup - family educational support (binary: 1 - yes or 0 - no) 
- 14: paid - extra paid classes within the course subject (binary: 1 - yes or 0 - no) 
- 15: activities - extra-curricular activities (binary: 1 - yes or 0 - no) 
- 16: nursery - attended nursery school (binary: 1 - yes or 0 - no) 
- 17: higher - wants to take higher education (binary: 1 - yes or 0 - no) 
- 18: internet - Internet access at home (binary: 1 - yes or 0 - no) 
- 19: romantic - with a romantic relationship (binary: 1 - yes or 0 - no) 
- 20: famrel - quality of family relationships (numeric: from 1 - very bad to 5 - excellent) 
- 21: freetime - free time after school (numeric: from 1 - very low to 5 - very high) 
- 22: goout - going out with friends (numeric: from 1 - very low to 5 - very high) 
- 23: Dalc - workday alcohol consumption (numeric: from 1 - very low to 5 - very high) 
- 24: Walc - weekend alcohol consumption (numeric: from 1 - very low to 5 - very high) 
- 25: health - current health status (numeric: from 1 - very bad to 5 - very good) 
- 26: absences - number of school absences (numeric: from 0 to 93) 
- 27: G1 - first period grade (numeric: from 0 to 20) 
- 28: G2 - second period grade (numeric: from 0 to 20) 
- 29: G3 - final grade (numeric: from 0 to 20, output target)

10 - Calcula la media de notas finales (G3) para cada una de las escuelas junto con sus respectivas desviaciones estandar.

In [19]:
import pandas as pd
# Carga del fichero nucleospoblacion.csv
df_students = pd.read_csv('pandas/student_performance_dataset.csv')

print(df_students[df_students['school'] == 0]['G3'].mean())
print(df_students[df_students['school'] == 1].G3.mean())

# Metodo 2
df_students[['school','G3']].groupby(['school']).agg({"G3":["mean", "std"]})

12.576832151300236
10.650442477876107

               G3
             mean       std
school
0       12.576832  2.625636
1       10.650442  3.833991

11 - De que forma influye el tiempo de estudio en los resultados de los estudiantes?. Por ahora puedes sacar las medias de las notas finales (G3) de cada asignatura. Puedes sacar las medias e imprimirlas de momento.

In [20]:
for studytime in range(1,5):
    #print(students[:, 0] == escuela)
    print("Study time {}: g3 mean: {}".format(studytime,df_students[df_students["studytime"] == studytime]['G3'].mean()))
    
df_students[['studytime','G3']].groupby(['studytime']).mean()

Study time 1: g3 mean: 10.84433962264151
Study time 2: g3 mean: 12.091803278688525
Study time 3: g3 mean: 13.22680412371134
Study time 4: g3 mean: 13.057142857142857

                  G3
studytime
1          10.844340
2          12.091803
3          13.226804
4          13.057143

12 - El numero de ausencias al colegio parece influir en las notas de los alumnos?. Para ello puedes realizar el estudio a intervalos de [1-10, 11-20, 21-30...80-90]. Filtra aquellos que tengan mas de 90 faltas para que los rangos de estudio sean homogeneos.

In [48]:
df_students['absences_int'] = df_students['absences'] // 10
df_students[['absences_int','G3']].groupby(['absences_int']).mean()

                     G3
absences_int
0             12.000000
1             11.177419
2              9.333333
3             15.000000

13 - Cuanto estudiantes han sacado la maxima nota (19) en las notas finales (G3)?

In [21]:
print(df_students[df_students['G3'] == 19]['G3'].value_counts())

19    2
Name: G3, dtype: int64

14 - Compara las medias de aquellos que reciben clases extra y estudian mas de de 5 horas con aquellos que no reciben clases extra y estudian menos de 5 horas.

In [66]:
print(df_students[(df_students['paid'] == 1) & (df_students['studytime'] >= 3)]['G3'].mean())
print(df_students[(df_students['paid'] == 0) & (df_students['studytime'] < 3)]['G3'].mean())

10.857142857142858
11.6

15 - Calcula la media y la desviacion estandar de las diferencias entre notas del segundo (G2) y primer semestre (G1). Han mejorado los alumnos sus notas?.

In [80]:
df_students['diffG1G2'] = df_students['G2'] - df_students['G1']
print(df_students['diffG1G2'].mean())
print(df_students['diffG1G2'].std())

0.17103235747303544
1.4792888099389632

16 - Sacan mejores notas las chicas que tiene una relacion romantica que aquellas que no la tienen?. Realiza los calculos para la nota final (G3).

In [5]:
#print(df_students[df_students['sex'] == 0].groupby(['romantic'])['G3'].mean())

df_students[df_students['sex'] == 0][['G3', 'romantic']].groupby('romantic').mean()

                 G3
romantic
0         11.589189
1         10.987654

17 - Haz una comparacion de chicos y chicas y que beben y no beben los fines de semana para saber si hay diferencias en las notas. Puedes mostrar las medias de cada uno de los cuatro grupos.

In [4]:
df_students[['G3', 'sex', 'Walc']].groupby(['sex', 'Walc']).mean()

                 G3
sex Walc
0   1     12.704225
    2     12.294118
    3     10.428571
    4     10.754386
    5     10.026316
1   1     12.221591
    2     12.242424
    3     12.521127
    4     11.566667
    5     13.428571